//
// Created by Daniel Smith on 3/9/16.
// Copyright (c) 2016 Dani Smith. All rights reserved.
//

import Foundation

/** This class formats an integer into a sefira day */
public class SefiraFormatter {
    public var ashkenazTransliteratedStrings: [String]?
    public var sefardTransliteratedStrings: [String]?
	//TODO: Implement English Strings as localized strings
//    public var englishStrings: [String]?

    /**
     *  The custom for the formatter to use.
     */
    public var custom = SefiraCustom.Sefard

    /**
     *  The language for the formatter to use.
     */
    public var language = SefiraLanguage.Hebrew

    public init() {
        language = SefiraLanguage.Hebrew
        custom = SefiraCustom.Ashkenaz
	}
	public static func sefiraText(day: Int, language: SefiraLanguage = .Hebrew,
								  custom: SefiraCustom = .Ashkenaz,
								  showKabbalah: Bool = false,
								  showLesheim: Bool = false,
								  showBracha: Bool = false,
								  showHarachaman: Bool = false,
								  showLamenatzaiach:Bool = false,
								  showAna:Bool = false,
								  showRibono:Bool = false,
								  showAleinu:Bool = false) -> String {
		let formatter = SefiraFormatter()
		formatter.language = language
		formatter.custom = custom
		var resultText = ""
		if showLesheim {
			resultText.append(formatter.lesheimYichud)
		}
		if showBracha {
			resultText.append(formatter.bracha)
		}
		resultText.append(
			"<big>" + (formatter.stringFromInteger(num: day) ?? "") + "</big>")
		resultText.append("\n\n")
		
		if showKabbalah {
			resultText.append("<br>")
			resultText.append("<small>")
			resultText.append(formatter.kabbalisticTrait(from: day) ?? "")
			resultText.append("</small>")
			
		}
		if showHarachaman {resultText.append(formatter.harachaman)}
		if showLamenatzaiach {resultText.append(formatter.lamenatzaiach)}
		if showAna {resultText.append(formatter.anaBakoach)}
		if showRibono {resultText.append(formatter.ribono(day: day))}
		if showAleinu {resultText.append(formatter.aleinu)}
		return resultText
		
		
	}

	public func stringFromInteger(num: Int) -> String? {
		if num < 0 || num > 49 {
			return nil
		}
//		if let composite: [[String]] = [ashkenazHebrewStrings, sefardHebrewStrings, sephardicHebrewStrings] {
//			if language == .English {
//				custom = .Ashkenaz //  There's only one version of English.
//			}
//			return composite[language][custom][num + 1]
//		}
		var strings: [String]!
		if language == .Hebrew {
			
			switch custom {
			case .Ashkenaz:
				strings = ashkenazHebrewStrings
			case .Sefard:
				strings = sefardHebrewStrings
			case .Sephardic:
				strings = sephardicHebrewStrings
			default:
				return nil
			}
		}
		return strings[num - 1]
	}
	
    let ashkenazHebrewStrings = [
        "הַיוֹם יוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם שְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם אַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם חֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁבְעָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד בָּעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וְיוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם תִּשְׁעָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם עֲשָׂרָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם אֲחַד עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וְאַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁנֵים עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וַחֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד ושִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם אַרְבָּעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת בָּעוֹמֶר",
        "הַיוֹם חֲמִשָׁה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם שִׁשָׁה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁבְעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְאַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם תִּשְׁעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם עֶשְׂרִים יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת ושִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם אֶחָד וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת בָּעוֹמֶר",
        "הַיוֹם שְׁנַיִם וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם אַרְבָּעָה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם חֲמִשָׁה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁשָׁה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁבְעָה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה וְעֶשְׂרים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת בָּעוֹמֶר",
        "הַיוֹם תִּשְׁעָה וְעֶשְׂרים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם שְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם אֶחָד וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁנַיִם וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם אַרְבָּעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ושִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם חֲמִשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת בָּעוֹמֶר",
        "הַיוֹם שִׁשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם שִׁבְעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם תִּשְׁעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם אַרְבָּעִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם אֶחָד וְאַרְבָּעִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת בָּעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד בָּעוֹמֶר",
        "הַיוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים בָּעוֹמֶר",
        "הַיוֹם חֲמִשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים בָּעוֹמֶר",
        "הַיוֹם שִׁבְעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים בָּעוֹמֶר",
        "הַיוֹם תִּשְׁעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁבְעָה שָׁבוּעוֹת בָּעוֹמֶר"]

    let sefardHebrewStrings = [
        "הַיוֹם יוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם שְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם חֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁבְעָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד לָעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וְיוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם תִּשְׁעָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם עֲשָׂרָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אֲחַד עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וְאַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁנֵים עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וַחֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד ושִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אַרְבָּעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת לָעוֹמֶר",
        "הַיוֹם חֲמִשָׁה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם שִׁשָׁה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁבְעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם תִּשְׁעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם עֶשְׂרִים יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת ושִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אֶחָד וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת לָעוֹמֶר",
        "הַיוֹם שְׁנַיִם וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם אַרְבָּעָה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם חֲמִשָׁה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁשָׁה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁבְעָה וְעֶשְׂרים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה וְעֶשְׂרים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת לָעוֹמֶר",
        "הַיוֹם תִּשְׁעָה וְעֶשְׂרים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם שְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם אֶחָד וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁנַיִם וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אַרְבָּעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ושִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם חֲמִשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת לָעוֹמֶר",
        "הַיוֹם שִׁשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם שִׁבְעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם תִּשְׁעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם אַרְבָּעִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אֶחָד וְאַרְבָּעִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת לָעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם חֲמִשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁבְעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם תִּשְׁעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁבְעָה שָׁבוּעוֹת לָעוֹמֶר"]

    let sephardicHebrewStrings = [
        "הַיוֹם יוֹם אֶחָד לָעוֹמֶר",
        "הַיוֹם שְׁנֵי יָמִים לָעוֹמֶר",
        "הַיוֹם שְׁלֹשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם אַרְבָּעָה יָמִים לָעוֹמֶר",
        "הַיוֹם חֲמִשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁשָׁה יָמִים לָעוֹמֶר",
        "הַיוֹם שִׁבְעָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד",
        "הַיוֹם שְׁמוֹנָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וְיוֹם אֶחָד",
        "הַיוֹם תִּשְׁעָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁנֵי",
        "הַיוֹם עֲשָׂרָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁלֹשָׁה יָמִים",
        "הַיוֹם אֲחַד עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וְאַרְבָּעָה יָמִים",
        "הַיוֹם שְׁנֵים עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וַחֲמִשָׁה יָמִים",
        "הַיוֹם שְׁלֹשָׁה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד ושִׁשָׁה יָמִים",
        "הַיוֹם אַרְבָּעָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת",
        "הַיוֹם חֲמִשָׁה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד",
        "הַיוֹם שִׁשָׁה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים",
        "הַיוֹם שִׁבְעָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",
        "הַיוֹם שְׁמוֹנָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְאַרְבָּעָה יָמִים",
        "הַיוֹם תִּשְׁעָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחֲמִשָׁה יָמִים",
        "הַיוֹם עֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְשִׁשָׁה יָמִים",
        "הַיוֹם אֶחָד וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת",
        "הַיוֹם שְׁנַיִם וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד",
        "הַיוֹם שְׁלֹשָׁה וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים",
        "הַיוֹם אַרְבָּעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",
        "הַיוֹם חֲמִשָׁה וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים",
        "הַיוֹם שִׁשָׁה וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים",
        "הַיוֹם שִׁבְעָה וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְשִׁשָׁה יָמִים",
        "הַיוֹם שְׁמוֹנָה וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת",
        "הַיוֹם תִּשְׁעָה וְעֶשְׂרים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד",
        "הַיוֹם שְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים",
        "הַיוֹם אֶחָד וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",
        "הַיוֹם שְׁנַיִם וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים",
        "הַיוֹם שְׁלֹשָׁה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים",
        "הַיוֹם אַרְבָּעָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ושִׁשָׁה יָמִים",
        "הַיוֹם חֲמִשָׁה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת",
        "הַיוֹם שִׁשָׁה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד",
        "הַיוֹם שִׁבְעָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים",
        "הַיוֹם שְׁמוֹנָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",
        "הַיוֹם תִּשְׁעָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים",
        "הַיוֹם אַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים",
        "הַיוֹם אֶחָד וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְשִׁשָׁה יָמִים",
        "הַיוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת",
        "הַיוֹם שְׁלֹשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד",
        "הַיוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים",
        "הַיוֹם חֲמִשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",
        "הַיוֹם שִׁשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים",
        "הַיוֹם שִׁבְעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים",
        "הַיוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְשִׁשָׁה יָמִים",
        "הַיוֹם תִּשְׁעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁבְעָה שָׁבוּעוֹת"]

    let hebrewKabbalisticStrings = [
        "חֶסֶד שֶבְּחֶסֶד",
        "גְבוּרָה שֶבְּחֶסֶד",
        "תִּפֶארֶת שֶבְּחֶסֶד",
        "נֶצַח שֶבְּחֶסֶד",
        "הוֹד שֶבְּחֶסֶד",
        "יְסֹוד שֶבְּחֶסֶד",
        "מַלְכוּת שֶבְּחֶסֶד",
        "חֶסֶד שֶבְּגְבוּרָה",
        "גְבוּרָה שֶבְּגְבוּרָה",
        "תִּפֶארֶת שֶבְּגְבוּרָה",
        "נֶצַח שֶבְּגְבוּרָה",
        "הוֹד שֶבְּגְבוּרָה",
        "יְסֹוד שֶבְּגְבוּרָה",
        "מַלְכוּת שֶבְּגְבוּרָה",
        "חֶסֶד שֶבְּתִּפֶארֶת",
        "גְבוּרָה שֶבְּתִּפֶארֶת",
        "תִּפֶארֶת שֶבְּתִּפֶארֶת",
        "נֶצַח שֶבְּתִּפֶארֶת",
        "הוֹד שֶבְּתִּפֶארֶת",
        "יְסֹוד שֶבְּתִּפֶארֶת",
        "מַלְכוּת שֶבְּתִּפֶארֶת",
        "חֶסֶד שֶבְּנֶצַח",
        "גְבוּרָה שֶבְּנֶצַח",
        "תִּפֶארֶת שֶבְּנֶצַח",
        "נֶצַח שֶבְּנֶצַח",
        "הוֹד שֶבְּנֶצַח",
        "יְסֹוד שֶבְּנֶצַח",
        "מַלְכוּת שֶבְּנֶצַח"
        , "חֶסֶד שֶבְּהוֹד",
        "גְבוּרָה שֶבְּהוֹד",
        "תִּפֶארֶת שֶבְּהוֹד",
        "נֶצַח שֶבְּהוֹד",
        "הוֹד שֶבְּהוֹד",
        "יְסֹוד שֶבְּהוֹד",
        "מַלְכוּת שֶבְּהוֹד",
        "חֶסֶד שֶבְּיְסֹוד",
        "גְבוּרָה שֶבְּיְסֹוד",
        "תִּפֶארֶת שֶבְּיְסֹוד",
        "נֶצַח שֶבְּיְסֹוד",
        "הוֹד שֶבְּיְסֹוד",
        "יְסֹוד שֶבְּיְסֹוד",
        "מַלְכוּת שֶבְּיְסֹוד",
        "חֶסֶד שֶבְּמַלְכוּת",
        "גְבוּרָה שֶבְּמַלְכוּת",
        "תִּפֶארֶת שֶבְּמַלְכוּת",
        "נֶצַח שֶבְּמַלְכוּת",
        "הוֹד שֶבְּמַלְכוּת",
        "יְסֹוד שֶבְּמַלְכוּת",
        "מַלְכוּת שֶבְּמַלְכוּת"]
	
	var harachaman: String {
		if custom == .Sephardic {
			return "הָרַחֲמָן הוּא יִבְנֶה בֵּית הַמִקְדָשׁ, ְויַחֲזֵיר הָעֲבוֹדָה לִמְקוֹמָה בִּמְהֵרָה בְיָמֵינוּ. אָמֵן\n\n"
		}
		return "הָרַחֲמָן הוּא יַחֲזִיר לָֽנוּ עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ, בִּמְהֵרָה בְיָמֵֽינוּ אָמֵן סֶֽלָה.\n\n"
	}

	var lesheimYichud: String {
		if custom == .Sephardic {
			return "לְשֵׁם יִחוּד קוּדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ בִּדְחִילוּ וּרְחִימוּ. לְיַחֵדָא שֵׁם יוֹד קֵי בְּוָאו קֵי בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל הִנֵּה אֲנַחְנוּ בָּאִים לְקַיֵּם מִצְוַת עֲשֵׂה שֶׁל סְפִירַת הָעֹמֶר. כְּדִכְתִיב: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה. שֶׁבַע שַׁבָּתוֹת תְּמִימוֹת תִּהְיֶינָה. עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִית תִּסְפְּרוּ חֲמִשִּׁים יוֹם. וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיהוָה: לְתַקֵּן אֶת שָׁרְשָׁה בְּמָקוֹם עֶלְיוֹן. לַעֲשֹוֹת נַחַת רוּח לְיוֹצְרֵנוּ וְלַעֲשֹוֹת רְצוֹן בּוֹרְאֵנוּ. וִיהִי נוֹעַם אֲדנָי אֱלהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ: יְהוָה, יִגְמֹר בַּעֲדִי. יְהוָה, חַסְדְּךָ לְעוֹלָם; מַעֲשֵׂי יָדֶיךָ אַל-תֶּרֶף: אֶקְרָא, לֵאלֹהִים עֶלְיוֹן; לָאֵל, גֹּמֵר עָלָי: וָאֶעֱבֹר עָלַיִךְ וָאֶרְאֵךְ, מִתְבּוֹסֶסֶת בְּדָמָיִךְ, וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי, וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי: בָּרְכִי נַפְשִׁי, אֶת-יְהוָה: יְהוָה אֱלֹהַי, גָּדַלְתָּ מְּאֹד; הוֹד .וְהָדָר לָבָשְׁתָּ. עֹטֶה-אוֹר, כַּשַּׂלְמָה, נוֹטֶה שָׁמַיִם, כַּיְרִיעָה\n\n"
		}
		return "לְשֵׁם יִחוּד קֻדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּהּ, בִּדְחִילוּ וּרְחִימוּ, לְיַחֵד שֵׁם י\"ה בְּו\"ה בְּיִחוּדָא שְׁלִים, בְֹּשֵם כָּל יִשְׂרָאֵל. הִנְנִי מוּכָן וּמְזֻמָּן לְקַיֵּם מִצְוַת עֲשֵׂה שֶׁל סְפִירַת הָעֹֽמֶר, כְּמוֹ שֶׁכָּתוּב בַּתּוֹרָה: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹֽמֶר הַתְּנוּפָה, שֶֽׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶֽינָה. עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַייָ. וִיהִי נֹֽעַם אֲדֹנָי אֱלֹהֵֽינוּ עָלֵֽינוּ, וּמַעֲשֵׂה יָדֵֽינוּ כּוֹנְנָה עָלֵֽינוּ, וּמַעֲשֵׂה יָדֵֽינוּ כּוֹנְנֵֽהוּ.\n\n"
	}
	let bracha = ".בָּרוּךְ אַתָּה יְיָ אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָֽׁנוּ בְּמִצְוֹתָיו, וְצִוָּֽנוּ עַל סְפִירַת הָעֹֽמֶר\n\n"
	let lamenatzaiach = "לַמְנַצֵּֽחַ בִּנְגִינוֹת מִזְמוֹר שִׁיר. אֱלֹהִים יְחָנֵּֽנוּ וִיבָרְכֵֽנוּ, יָאֵר פָּנָיו אִתָּֽנוּ סֶֽלָה. לָדַֽעַת בָּאָֽרֶץ דַּרְכֶּֽךָ, בְּכָל גּוֹיִם יְשׁוּעָתֶֽךָ. יוֹדֽוּךָ עַמִּים, אֱלֹהִים, יוֹדֽוּךָ עַמִּים כֻּלָּם. יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים, כִּי תִשְׁפּוֹט עַמִּים מִישׁוֹר, וּלְאֻמִּים בָּאָֽרֶץ תַּנְחֵם סֶֽלָה. יוֹדֽוּךָ עַמִּים, אֱלֹהִים, יוֹדֽוּךָ עַמִּים כֻּלָּם. אֶֽרֶץ נָתְנָה יְבוּלָהּ, יְבָרְכֵֽנוּ אֱלֹהִים אֱלֹהֵֽינוּ. יְבָרְכֵֽנוּ אֱלֹהִים, וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָֽרֶץ.\n\n"
	let anaBakoach = "אָנָּא בְּכֹֽחַ גְּדֻלַּת יְמִינְךָ, תַּתִּיר צְרוּרָה. \nאב\"ג ית\"ץ\nקַבֵּל רִנַּת עַמְּךָ, שַׂגְּבֵֽנוּ, טַהֲרֵֽנוּ, נוֹרָא.\nקר\"ע שט\"ן\nנָא גִבּוֹר, דּוֹרְשֵׁי יִחוּדְךָ, כְּבָבַת שָׁמְרֵם.\nנג\"ד יכ\"ש\nבָּרְכֵם, טַהֲרֵם, רַחֲמֵם, צִדְקָתְךָ תָּמִיד גָּמְלֵם. \nבט\"ר צת\"ג \nחֲסִין קָדוֹשׁ, בְּרוֹב טוּבְךָ, נַהֵל עֲדָתֶֽךָ. \nחק\"ב טנ\"ע \nיָחִיד גֵּאֶה, לְעַמְּךָ פְּנֵה, זוֹכְרֵי קְדֻשָּׁתֶֽךָ.\nיג\"ל פז\"ק \nשַׁוְעָתֵֽנוּ קַבֵּל, וּשְׁמַע צַעֲקָתֵֽנוּ, יוֹדֵֽעַ תַּעֲלֻמוֹת. \nשק\"ו צי\"ת\n\nבָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד.\n\n"
	let aleinu = "עָלֵינוּ לְשַׁבֵּחַ לַאֲדוֹן הַכֹּל. לָתֵת גְּדֻלָּה לְיוֹצֵר בְּרֵאשִׁית. שֶׁלֹּא עָשָׂנוּ כְּגוֹיֵי הָאֲרָצוֹת. וְלֹא שָׂמָנוּ כְּמִשְׁפְּחוֹת הָאֲדָמָה. שֶׁלֹּא שָׂם חֶלְקֵנוּ כָּהֶם וְגוֹרָלֵנוּ כְּכָל הֲמוֹנָם. שֶׁהֵם מִשְׁתַּחֲוִים לְהֶבֶל וָרִיק וּמִתְפַּלְלִים אֶל אֵל לֹא יושִׁיעַ וַאֲנַחְנוּ כּוֹרְעִים וּמִשְׁתַּחֲוִים וּמוֹדִים לִפְנֵי מֶלֶךְ מַלְכֵי הַמְּלָכִים הַקָּדושׁ בָּרוּךְ הוּא. שֶׁהוּא נוֹטֶה שָׁמַיִם וְיוֹסֵד אָרֶץ. וּמושַׁב יְקָרוֹ בַּשָּׁמַיִם מִמַּעַל. וּשְׁכִינַת עֻזּו בְּגָבְהֵי מְרוֹמִים. הוּא אֱלהֵינוּ אֵין עוֹד. אֱמֶת מַלְכֵּנוּ. אֶפֶס זוּלָתוֹ. כַּכָּתוּב בְּתוֹרָתוֹ. וְיָדַעְתָּ הַיּום וַהֲשֵׁבֹתָ אֶל לְבָבֶךָ. כִּי ה' הוּא הָאֱלֹהִים בַּשָּׁמַיִם מִמַּעַל וְעַל הָאָרֶץ מִתָּחַת. אֵין עוֹד:\n\nוְעַל כֵּן נְקַוֶּה לְּךָ ה' אֱלהֵינוּ לִרְאוֹת מְהֵרָה בְּתִפְאֶרֶת עֻזֶּךָ. לְהַעֲבִיר גִּלּוּלִים מִן הָאָרֶץ. וְהָאֱלִילִים כָּרוֹת יִכָּרֵתוּן. לְתַקֵּן עוֹלָם בְּמַלְכוּת שַׁדַּי. וְכָל בְּנֵי בָשָׂר יִקְרְאוּ בִשְׁמֶךָ לְהַפְנוֹת אֵלֶיךָ כָּל רִשְׁעֵי אָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל יושְׁבֵי תֵבֵל. כִּי לְךָ תִּכְרַע כָּל בֶּרֶךְ. תִּשָּׁבַע כָּל לָשׁוֹן. לְפָנֶיךָ ה' אֱלֹהֵינוּ יִכְרְעוּ וְיִפֹּלוּ. וְלִכְבוֹד שִׁמְךָ יְקָר יִתֵּנוּ. וִיקַבְּלוּ כֻלָּם אֶת עֹל מַלְכוּתֶךָ. וְתִמְלךְ עֲלֵיהֶם מְהֵרָה לְעוֹלָם וָעֶד. כִּי הַמַּלְכוּת שֶׁלְּךָ הִיא וּלְעוֹלְמֵי עַד תִּמְלךְ בְּכָבוֹד. כַּכָּתוּב בְּתוֹרָתֶךָ. ה' יִמְלךְ לְעוֹלָם וָעֶד: וְנֶאֱמַר. וְהָיָה ה' לְמֶלֶךְ עַל כָּל הָאָרֶץ. בַּיּום הַהוּא יִהְיֶה ה' אֶחָד וּשְׁמוֹ אֶחָד.\n\n"

	func ribono(day: Int) -> String {
		
		if let trait = self.kabbalisticTrait(from: day) {
			
			return String(format:"רִבּוֹנוֹ שֶׁל עוֹלָם, אַתָּה צִוִּיתָֽנוּ עַל יְדֵי מֹשֶׁה עַבְדֶּֽךָ לִסְפּוֹר סְפִירַת הָעֹֽמֶר, כְּדֵי לְטַהֲרֵֽנוּ מִקְּלִפּוֹתֵֽינוּ וּמִטֻּמְאוֹתֵֽינוּ, כְּמוֹ שֶׁכָּתַֽבְתָּ בְּתוֹרָתֶֽךָ: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹֽמֶר הַתְּנוּפָה, שֶֽׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶֽינָה, עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, כְּדֵי שֶׁיִּטָּהֲרוּ נַפְשׁוֹת עַמְּךָ יִשְׂרָאֵל מִזֻּהֲמָתָם. וּבְכֵן יְהִי רָצוֹן מִלְּפָנֶֽיךָ יְיָ אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁבִּזְכוּת סְפִירַת הָעֹֽמֶר שֶׁסָּפַֽרְתִּי הַיּוֹם, יְתֻקַּן מַה שֶּׁפָּגַֽמְתִּי בִּסְפִירָה %@ וְאֶטָּהֵר וְאֶתְקַדֵּשׁ בִּקְדֻשָּׁה שֶׁל מַֽעְלָה, וְעַל יְדֵי זֶה יֻשְׁפַּע שֶֽׁפַע רַב בְּכָל הָעוֹלָמוֹת, וּלְתַקֵּן אֶת נַפְשׁוֹתֵֽינוּ וְרוּחוֹתֵֽינוּ וְנִשְׁמוֹתֵֽינוּ מִכָּל סִיג וּפְגַם, וּלְטַהֲרֵֽנוּ וּלְקַדְּשֵֽׁנוּ בִּקְדֻשָּׁתְךָ הָעֶלְיוֹנָה, אָמֵן סֶֽלָה.\n\n", trait)
		}
		return ""
	}
	
	func kabbalisticTrait(from day: Int) -> String? {
		if day < 0 || day > hebrewKabbalisticStrings.count {return nil}
		
		return hebrewKabbalisticStrings[day - 1]
		
	}
	// MARK: - Helpers
	
	/**
	*  Generates a statically allocated map of all of the omer count strings.
	*
	*  @return A multidimensional array of all of the sets of output strings.
	*/
	
//	func _omerCountStringMap() -> [[[AnyObject]]] {
//		var omerMap:[[[String]]]! = nil
//
//		if omerMap == nil
//		{
//			omerMap = [
//				/** Hebrew */
//				[
//					ashkenazHebrewStrings,
//					sefardHebrewStrings,
//					sephardicHebrewStrings,
//				],
//				/** Localized */
////				[_localizedStrings],
//				/** Transliterated. */
////				[_ashkenazTransliteratedStrings,
////				 _sefardTransliteratedStrings,
////				 _sephardicTransliteratedStrings]
//			]
//		}
//
//		return omerMap
//	}

}

/**
 *  This flag determines which custom to use when returning a formatted string.
 */
public enum SefiraCustom: Int {
    case Ashkenaz //  Uses the bet prefix
    case Sefard //  Uses the lamed prefix
    case Sephardic //  Uses the lamed prefix and sephardic formula
    case Ari // Chabad - not sure what's different here yet.
}

/**
 *  This flag determines which language to use to display the text.
 */
public enum SefiraLanguage: Int {
    case Hebrew //  The count, in Hebrew
    case English //  The count, in English
    case TransliteratedHebrew //  The count, in Hebrew, spelled in English
}

/**
 *  The options for the formatter.
 *
 *  If the SefiraLanguage is not set to SefiraLanguageHebrew
 *  or SefiraCustom is not SefiraCustomAshkenaz, these flags are ignored.
 */
public enum SefiraPrayerAddition: Int {
    case LeshaimYichud // = 1 << 0
    case Beracha // = 1 << 1
    case Harachaman // = 1 << 2
    case Lamenatzaiach // = 1 << 3
    case Ana // = 1 << 4
    case Ribono // = 1 << 5
    case Aleinu // = 1 << 6
}
